Reports/ТаблицыКоманд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ТаблицыКоманд</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/Игры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Игры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выигр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ничьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пораж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПОчки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГдеИгра</Name>
					<Comment>1 - дома 2 - выезд</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Тур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Тур</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Игры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СыграноИгр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Игры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хозяин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гость</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сыгран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ТаблицыКоманд/Forms/ФормаОтчета/Ext/Form/Module.bsl
// http://infostart.ru/public/78455/

Перем Дата;

&НаКлиенте
Процедура Сформировать(Команда)
	
	Обновить()
	
КонецПроцедуры

&НаСервере
Процедура Обновить() Экспорт
	
	ЭтоПродолжениеСезона = Сезон.флПереходныйСезон;
	Элементы.КнопкаВперед.Видимость = ЭтоПродолжениеСезона;
	Элементы.КнопкаНазад.Видимость = ЭтоПродолжениеСезона;
	
	//Макет = Отчеты.ТаблицыКоманд.ПолучитьМакет("Макет");
	
	// для отладки использовать
	ЭтаОбработка = РеквизитФормыВЗначение("Отчет");	// или этот отчет
	Макет = ЭтаОбработка.мВернутьМакет();
	// "обратно" после работы с макетом
	// ЗначениеВРеквизитФормы(Макет, "Отчет");
	// нет необходимости - вывод уже сделан
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали|Команда");
	ОбластьДетальныхПоследние5 = Макет.ПолучитьОбласть("Детали|Последние5");
	
	ОбластьПикто = ОбластьДетальныхЗаписей.Область("областьПикто");
	ОбластьКартинки5 = ОбластьДетальныхПоследние5.Область("область5");
	
	//Рисунок = ОбластьДетальныхЗаписей.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	//Рисунок.ГраницаСлева = Ложь;
	//Рисунок.ГраницаСверху = Ложь;
	//Рисунок.ГраницаСнизу = Ложь;
	//Рисунок.ГраницаСправа = Ложь;
	//Рисунок.Высота = позВысота;	//3.5;
	//Рисунок.Ширина = позШирина;	//5;
	//Рисунок.Лево = позЛево;	//9;
	//Рисунок.Верх = позВерх;	//0;
	//Рисунок.Картинка = Новый Картинка(БиблиотекаКартинок["Up"].ПолучитьДвоичныеДанные());
	//Рисунок.РазмерКартинки = позРазмерКартинки;
	
	КартинкаВверх	= Новый Картинка(БиблиотекаКартинок.Up.ПолучитьДвоичныеДанные());
	КартинкаВниз	= Новый Картинка(БиблиотекаКартинок.Down.ПолучитьДвоичныеДанные());
	
	// определить места по рез-там прошедшего тура
	
	КоличествоКоманд = обПолучитьКоличествоКомандВСезоне(Сезон);
	ТекущийСезон = омВызовСервера.обПолучитьТекущийСезонСервер();
	
	ПоследнийТурСезона = (КоличествоКоманд - 1) * 2;
	ПоследнийСыгранныйТурСезона = обПоследнийСыгранныйТурСезона(Сезон);
	РазбиватьНаПоловины = Ложь;
	
	Если Тур2 = 1 Тогда
		ПредпоследнийТур = Тур2
	ИначеЕсли Тур2 > 0 Тогда
		ПредпоследнийТур = Тур2 - 1
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ИгрыОбороты.Тур КАК Тур,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИгрыОбороты.Кто)  КАК Кто
		|ИЗ
		|	РегистрНакопления.Игры.Обороты(, , , Сезон = &Сезон) КАК ИгрыОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ИгрыОбороты.Тур
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИгрыОбороты.Кто)  > &Количество
		|
		|УПОРЯДОЧИТЬ ПО
		|	Тур УБЫВ";
		
		Запрос.УстановитьПараметр("Сезон", Сезон);
		//Запрос.УстановитьПараметр("Количество", КоличествоКоманд / 2);	// количество игр тура
		Запрос.УстановитьПараметр("Количество", 1);
		
		ВыборкаПоследний = Запрос.Выполнить().Выбрать();
		ПредпоследнийТур = 0;
		
		Если ВыборкаПоследний.Следующий() Тогда	// это последний полный тур
			ПоследнийТур = ВыборкаПоследний.Тур;
			Если ВыборкаПоследний.Следующий() Тогда	// это предпоследний полный тур
				ПредпоследнийТур = ВыборкаПоследний.Тур;
			КонецЕсли;
			
			Если ЭтоПродолжениеСезона И ПоследнийТур > ПоследнийТурСезона Тогда
				Элементы.КнопкаВперед.Доступность = Ложь;
				Элементы.КнопкаНазад.Доступность = Истина;
				РазбиватьНаПоловины = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	ТабДок.Очистить();
	ОбластьЗаголовок.Параметры.Заголовок = ?(ДВ=1, "Итоговая таблица", ?(ДВ=2,"дома", "выезд"));
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ТабДок.Рисунки.Очистить();
	нетЦв = Новый Цвет;
	
	
	// результаты предпоследнего полного тура
	тз2 = обПолучитьТекущиеМестаКоманд(ДВ, ?(Тур1 = 0, 1, Тур1), ПредпоследнийТур, Сезон);
	
	Если РазбиватьНаПоловины Тогда
		
		// по итогам первой половины "переходного" сезона
		тз16 = обПолучитьТекущиеМестаКоманд(1, 1, ПоследнийТурСезона, Сезон);
		сзЛидеры = Новый СписокЗначений;	// лидеры
		сзАут = Новый СписокЗначений;	// аутсайдеры
		
		Для сч = 1 По КоличествоКоманд/2 Цикл
			сзЛидеры.Добавить(тз16.Получить(сч-1).Кто);
			сзАут.Добавить(тз16.Получить(сч+КоличествоКоманд/2-1).Кто);
		КонецЦикла;	
	
		тз1 = обПолучитьТекущиеМестаГруппыКоманд(ДВ, Тур1, ?(Тур1 = 0, 0, Тур2), Сезон, сзЛидеры);
		тзАут = обПолучитьТекущиеМестаГруппыКоманд(ДВ, Тур1, ?(Тур1 = 0, 0, Тур2), Сезон, сзАут);
		
	Иначе
		
		// обычный "классический сезон"
		
		// текущие результаты
		тз1 = обПолучитьТекущиеМестаКоманд(ДВ, Тур1, ?(Тур1 = 0, 0, Тур2), Сезон);
	    тзАут = Новый ТаблицаЗначений
		
	КонецЕсли; 
	
	
	картВ	= Новый Картинка(БиблиотекаКартинок.шарикЗеленый.ПолучитьДвоичныеДанные());
	картН	= Новый Картинка(БиблиотекаКартинок.шарикЖелтый.ПолучитьДвоичныеДанные());
	картП	= Новый Картинка(БиблиотекаКартинок.шарикКрасный.ПолучитьДвоичныеДанные());
	
	счМесто = 1; МестоПредКом = 0;
	
	Для каждого стр из Тз1 Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьДетальныхЗаписей.Параметры, стр);
		Если ПоследнийСыгранныйТурСезона > 1 Тогда
			строка = тз2.Найти(стр.Кто, "Кто");
			//ПредМесто = тз2.Индекс(строка) + 1;
			ПредМесто = строка.Место12;
			
			РазницаМест = ПредМесто - счМесто;
			Если РазницаМест > 0 Тогда
				ОбластьДетальныхЗаписей.Рисунки.облКартинки.Картинка = КартинкаВверх;
				ОбластьДетальныхЗаписей.Параметры.Пикто = ?(РазницаМест>1, ""+РазницаМест, "");
				ОбластьПикто.ЦветТекста = WebЦвета.ТемноЗеленый;
			ИначеЕсли РазницаМест < 0 Тогда
				ОбластьДетальныхЗаписей.Рисунки.облКартинки.Картинка = КартинкаВниз;
				ОбластьДетальныхЗаписей.Параметры.Пикто = ?(РазницаМест<-1, ""+(-1)*РазницаМест, "");
				ОбластьПикто.ЦветТекста = WebЦвета.ТемноКрасный;
			Иначе	
				ОбластьДетальныхЗаписей.Параметры.Пикто = "";
				ОбластьДетальныхЗаписей.Рисунки.облКартинки.Картинка = Новый Картинка;
			КонецЕсли;	
		КонецЕсли;
	
		РМ = стр.РазнМячей;
		Если РМ <> Null Тогда
			РМ = ?(РМ > 0, "+", "") + РМ;
		Иначе 
			РМ = "0"
		КонецЕсли;
		ОбластьДетальныхЗаписей.Параметры.РазнМячей = РМ;
		
		// если показатели одинаковы абсолютно
		Если стр.Место12 = МестоПредКом Тогда
			ОбластьДетальныхЗаписей.Параметры.Место = "";
		Иначе	
			ОбластьДетальныхЗаписей.Параметры.Место = ""+счМесто+".";
		КонецЕсли;	
		МестоПредКом = стр.Место12;
			
		ОбластьДетальныхЗаписей.Области.облДетали.ЦветТекста = ПолучитьЦветТекущегоМестаКоманды(счМесто);
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		
		// последние 5
		Результат	= обПоследние5ИгрКоманды(стр.Кто,,ДВ-1 , Ложь, Тур2, Сезон);
		Выборка5		= Результат.Выбрать();
		
		Пока Выборка5.Следующий() Цикл
			
			//ОблДВ = ОбластьДетальныхПоследние5.Область("R1C"+(8+сч*?(Половина=1, -1, 1)));
			ТекстПримечания = "(" + Выборка5.Тур + ": " + Формат(Выборка5.Дата,"ДФ=dd.MM" + ?(Выборка5.Сезон = ТекущийСезон,"",".yy"))
					+ ?(Выборка5.Сезон = ТекущийСезон,""," сез"+Выборка5.Сезон.Код)+") "+Выборка5.Соперник+" "+обЧислоВСчет(Выборка5.СчетОборот) + " " + ?(Выборка5.ГдеИгра = 1, "д", "в");
			//ОбластьКартинки5.Примечание.ВыводитьНаПечать = Ложь;
			ОбластьКартинки5.Примечание.Текст = ТекстПримечания;
			
			Если Выборка5.Выигр > 0 Тогда
			//	//облДВ.ЦветТекста = ЦветПобеда;
				ОбластьДетальныхПоследние5.Рисунки.рисВНП.Картинка = картВ;
				//ОбластьДетальныхПоследние5.Параметры.ВНП = "В";
			ИначеЕсли Выборка5.Ничья > 0 Тогда
			//	//облДв.ЦветТекста = ЦветНичьи;
				ОбластьДетальныхПоследние5.Рисунки.рисВНП.Картинка = картН;
				//ОбластьДетальныхПоследние5.Параметры.ВНП = "Н";
			Иначе
			//	//облДВ.ЦветТекста = ЦветПораж;
				ОбластьДетальныхПоследние5.Рисунки.рисВНП.Картинка = картП;
				//ОбластьДетальныхПоследние5.Параметры.ВНП = "П";
			КонецЕсли;	
			ТабДок.Присоединить(ОбластьДетальныхПоследние5);

		КонецЦикла;
		
		//счч = сч;
		//
		//Для сч = счч По 5 Цикл
		//
		//	ОблДВ = ОбластьСтрока5.Область("R1C"+(8+сч*?(Половина=1, 1, -1)));
		//	ОблДВ.Примечание.Текст = "";
		
		//	облДВ.ЦветТекста = Новый Цвет;
		//	ОбластьСтрока5.Параметры[ИмяДВ+сч] = "";
		//
		//КонецЦикла;
		
		
		счМесто = счМесто + 1;
	КонецЦикла;

	Если РазбиватьНаПоловины Тогда
		ТабДок.Вывести(ОбластьПодвалТаблицы);
		ТабДок.Вывести(ОбластьШапкаТаблицы);
	КонецЕсли; 
	
	// только для нестандартного сезона (две равные группы команд - две таблицы)
	Для каждого стр из тзАут Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьДетальныхЗаписей.Параметры, стр);
		Если ПоследнийСыгранныйТурСезона > 1 Тогда
			строка = тз2.Найти(стр.Кто, "Кто");
			//ПредМесто = тз2.Индекс(строка) + 1;
			ПредМесто = строка.Место12;
			
			РазницаМест = ПредМесто - счМесто;
			Если РазницаМест > 0 Тогда
				ОбластьДетальныхЗаписей.Рисунки.облКартинки.Картинка = КартинкаВверх;
				ОбластьДетальныхЗаписей.Параметры.Пикто = ?(РазницаМест>1, ""+РазницаМест, "");
				ОбластьПикто.ЦветТекста = WebЦвета.ТемноЗеленый;
			ИначеЕсли РазницаМест < 0 Тогда
				ОбластьДетальныхЗаписей.Рисунки.облКартинки.Картинка = КартинкаВниз;
				ОбластьДетальныхЗаписей.Параметры.Пикто = ?(РазницаМест<-1, ""+(-1)*РазницаМест, "");
				ОбластьПикто.ЦветТекста = WebЦвета.ТемноКрасный;
			Иначе	
				ОбластьДетальныхЗаписей.Параметры.Пикто = "";
				ОбластьДетальныхЗаписей.Рисунки.облКартинки.Картинка = Новый Картинка;
			КонецЕсли;	
		КонецЕсли;	
		
		РМ = стр.РазнМячей;
		Если РМ <> Null Тогда
			РМ = ?(РМ > 0, "+", "") + РМ;
		Иначе 
			РМ = "0"
		КонецЕсли;
		ОбластьДетальныхЗаписей.Параметры.РазнМячей = РМ;
		
		// если показатели одинаковы абсолютно
		Если стр.Место12 = МестоПредКом Тогда
			ОбластьДетальныхЗаписей.Параметры.Место = "";
		Иначе	
			ОбластьДетальныхЗаписей.Параметры.Место = ""+счМесто+".";
		КонецЕсли;	
		МестоПредКом = стр.Место12;
			
		ТабДок.Вывести(ОбластьДетальныхЗаписей);
		счМесто = счМесто + 1;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// реквизит отчета
	Сезон = Константы.ТекущийСезон.Получить();
	ДВ = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Тур.Дата КАК Дата
	|ИЗ
	|	Документ.Тур КАК Тур
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Дата = Выборка.Дата
	Иначе
		Дата = ТекущаяДата()
	КонецЕсли;
	
	
	// можно с НачПериода по КонПериода, по N-тур с н.г., за 1(2) круг,с N по M туры !!!
	// нужна таблица соответствия туров и дат
	//
	// далее возможна статистика: СЕРИИ КОМАНД и т.п.
	//
	// РЕАЛИЗОВЫВАТЬ !
	
	Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦветТекущегоМестаКоманды(счМесто)

	ЦветКоманды = Новый Цвет;
	Если счМесто = 1 Тогда
		ЦветКоманды  = WebЦвета.Оранжевый
	ИначеЕсли счМесто = 2 Тогда
		ЦветКоманды  = WebЦвета.СинийСоСтальнымОттенком
	ИначеЕсли счМесто = 3 Тогда
		ЦветКоманды  = WebЦвета.Кирпичный
	ИначеЕсли счМесто > 14 Тогда
		ЦветКоманды  = WebЦвета.ТемноГрифельноСиний
	ИначеЕсли счМесто > 12 Тогда
		ЦветКоманды  = WebЦвета.ФуксинТемный
	КонецЕсли;
	
	Возврат ЦветКоманды

КонецФункции // ПолучитьЦветТекущегоМестаКоманды(счМесто)

&НаКлиенте
Процедура ДВПриИзменении(Элемент)
	Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Тур2Очистка(Элемент, СтандартнаяОбработка)
	
	Тур1 = 0;
	Тур2 = 0;
	
	Обновить();
	
КонецПроцедуры
&НаКлиенте
Процедура Тур2ПриИзменении(Элемент)
	
	Если Тур2 > 0 и Тур1 = 0 Тогда
		Тур1 = 1
	ИначеЕсли Тур2 < Тур1 Тогда
		Тур1 = Тур2
	КонецЕсли;	
	
КонецПроцедуры
&НаКлиенте
Процедура Тур1ПриИзменении(Элемент)
	
	Если Тур2 > 0 и Тур1 = 0 Тогда
		Тур1 = 1
	ИначеЕсли Тур2 < Тур1 Тогда
		Тур2 = Тур1
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Команда, Сезон, ДВ", Расшифровка, Сезон, ДВ);
	ОткрытьФорму("Отчет.ДанныеПоКоманде.Форма.ФормаОтчета", ПараметрыФормы);

КонецПроцедуры


&НаКлиенте
Процедура СезонПриИзменении(Элемент)
	
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура обрКнопкаВперед(Команда)
	
	Тур2 = 0;
	Тур1 = 0;
	Обновить()
		
КонецПроцедуры

&НаКлиенте
Процедура обрКнопкаНазад(Команда)
	
	Тур2 = ПоследнийТурСезона;
	Тур1 = 1;
	
	Обновить();
	
	Элементы.КнопкаВперед.Доступность = Истина;
	Элементы.КнопкаНазад.Доступность = Ложь
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененТекущийСезон" Тогда
		Сезон = омВызовИзКлиента.обПолучитьТекущийСезон()
	КонецЕсли;
	
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокВыбор(Элемент, Область, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
